a = input()
b = {11, 12, 13, 14, 111, 112, 113, 114, 211, 212, 213, 214, 311, 312, 313, 314, 411, 412, 413, 414, 511, 512, 513, 514, 611, 612, 613, 614, 711, 712, 713, 714, 811, 812, 813, 814, 911, 912, 913, 914}
c = int(a[-1])
f = int(a)
d = int(1)

if f == 1:
	print(a+" "+'программист')

elif f in b:
	print(a+" "+'программистов')

elif (2 <= c <= 4):
	print(a+" "+'программиста')

elif f % 10 == 0:
	print(a+" "+'программистов')

elif (f > 9) and (c == d) and (a[-1] != a[-2]):
		print(a+" "+'программист')

else:
	print(a+" "+'программистов')